In [213]:
# import kagglehub

# # Download latest version
# path = kagglehub.dataset_download("rishikeshkonapure/zomato")

# print("Path to dataset files:", path)

In [214]:
import pandas as pd #importing pandas library

In [215]:
df=pd.read_csv("zomato.csv") #loading the data

In [216]:
df.head() #head is used to view top 5 rows of the table

,url,address,name,online_order,book_table,rate,votes,phone,location,rest_type,dish_liked,cuisines,approx_cost(for two people),reviews_list,menu_item,listed_in(type),listed_in(city)
0,https://www.zomato.com/bangalore/jalsa-banasha...,"942, 21st Main Road, 2nd Stage, Banashankari, ...",Jalsa,Yes,Yes,4.1/5,775,080 42297555\r\n+91 9743772233,Banashankari,Casual Dining,"Pasta, Lunch Buffet, Masala Papad, Paneer Laja...","North Indian, Mughlai, Chinese",800,"[('Rated 4.0', 'RATED\n A beautiful place to ...",[],Buffet,Banashankari
1,https://www.zomato.com/bangalore/spice-elephan...,"2nd Floor, 80 Feet Road, Near Big Bazaar, 6th ...",Spice Elephant,Yes,No,4.1/5,787,080 41714161,Banashankari,Casual Dining,"Momos, Lunch Buffet, Chocolate Nirvana, Thai G...","Chinese, North Indian, Thai",800,"[('Rated 4.0', 'RATED\n Had been here for din...",[],Buffet,Banashankari
2,https://www.zomato.com/SanchurroBangalore?cont...,"1112, Next to KIMS Medical College, 17th Cross...",San Churro Cafe,Yes,No,3.8/5,918,+91 9663487993,Banashankari,"Cafe, Casual Dining","Churros, Cannelloni, Minestrone Soup, Hot Choc...","Cafe, Mexican, Italian",800,"[('Rated 3.0', ""RATED\n Ambience is not that ...",[],Buffet,Banashankari
3,https://www.zomato.com/bangalore/addhuri-udupi...,"1st Floor, Annakuteera, 3rd Stage, Banashankar...",Addhuri Udupi Bhojana,No,No,3.7/5,88,+91 9620009302,Banashankari,Quick Bites,Masala Dosa,"South Indian, North Indian",300,"[('Rated 4.0', ""RATED\n Great food and proper...",[],Buffet,Banashankari
4,https://www.zomato.com/bangalore/grand-village...,"10, 3rd Floor, Lakshmi Associates, Gandhi Baza...",Grand Village,No,No,3.8/5,166,+91 8026612447\r\n+91 9901210005,Basavanagudi,Casual Dining,"Panipuri, Gol Gappe","North Indian, Rajasthani",600,"[('Rated 4.0', 'RATED\n Very good restaurant ...",[],Buffet,Banashankari

In [217]:
df.shape

(51717, 17)

In [218]:
df.info()  #info is used to get brief information about the dataset

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 51717 entries, 0 to 51716
Data columns (total 17 columns):
 #   Column                       Non-Null Count  Dtype
---  ------                       --------------  -----
 0   url                          51717 non-null  object
 1   address                      51717 non-null  object
 2   name                         51717 non-null  object
 3   online_order                 51717 non-null  object
 4   book_table                   51717 non-null  object
 5   rate                         43942 non-null  object
 6   votes                        51717 non-null  int64
 7   phone                        50509 non-null  object
 8   location                     51696 non-null  object
 9   rest_type                    51490 non-null  object
 10  dish_liked                   23639 non-null  object
 11  cuisines                     51672 non-null  object
 12  approx_cost(for two people)  51371 non-null  object
 13  reviews_list                 51717 non-null  object
 14  menu_item                    51717 non-null  object
 15  listed_in(type)              51717 non-null  object
 16  listed_in(city)              51717 non-null  object
dtypes: int64(1), object(16)
memory usage: 6.7+ MB

In [219]:
df.describe()

              votes
count  51717.000000
mean     283.697527
std      803.838853
min        0.000000
25%        7.000000
50%       41.000000
75%      198.000000
max    16832.000000

In [220]:
df.columns  #it is used to see all the columns in the dataset

Index(['url', 'address', 'name', 'online_order', 'book_table', 'rate', 'votes',
       'phone', 'location', 'rest_type', 'dish_liked', 'cuisines',
       'approx_cost(for two people)', 'reviews_list', 'menu_item',
       'listed_in(type)', 'listed_in(city)'],
      dtype='object')

In [221]:
 # Deleting unnecessary columns
# Renaming the columns
# Dropping duplicates
# Removeing Null Values from the dataset
# Checking for some morer Transformations
# '''

In [222]:
columns_keep=['name', 'online_order', 'book_table', 'rate','dish_liked','approx_cost(for two people)',
      'listed_in(city)']
columns_drop=['url', 'address','votes','phone', 'location', 'rest_type','cuisines','reviews_list', 'menu_item',
       'listed_in(type)']

In [223]:
len(columns_keep)

7

In [224]:
len(columns_drop)

10

In [225]:
columns_keep

['name',
 'online_order',
 'book_table',
 'rate',
 'dish_liked',
 'approx_cost(for two people)',
 'listed_in(city)']

In [226]:
df=df[columns_keep]

In [227]:
df

,name,online_order,book_table,rate,dish_liked,approx_cost(for two people),listed_in(city)
0,Jalsa,Yes,Yes,4.1/5,"Pasta, Lunch Buffet, Masala Papad, Paneer Laja...",800,Banashankari
1,Spice Elephant,Yes,No,4.1/5,"Momos, Lunch Buffet, Chocolate Nirvana, Thai G...",800,Banashankari
2,San Churro Cafe,Yes,No,3.8/5,"Churros, Cannelloni, Minestrone Soup, Hot Choc...",800,Banashankari
3,Addhuri Udupi Bhojana,No,No,3.7/5,Masala Dosa,300,Banashankari
4,Grand Village,No,No,3.8/5,"Panipuri, Gol Gappe",600,Banashankari
...,...,...,...,...,...,...,...
51712,Best Brews - Four Points by Sheraton Bengaluru...,No,No,3.6 /5,NaN,"1,500",Whitefield
51713,Vinod Bar And Restaurant,No,No,NaN,NaN,600,Whitefield
51714,Plunge - Sheraton Grand Bengaluru Whitefield H...,No,No,NaN,NaN,"2,000",Whitefield
51715,Chime - Sheraton Grand Bengaluru Whitefield Ho...,No,Yes,4.3 /5,"Cocktails, Pizza, Buttermilk","2,500",Whitefield
51716,The Nest - The Den Bengaluru,No,No,3.4 /5,NaN,"1,500",Whitefield

In [228]:
n_columns=[]
for i in df.columns:
    n_columns.append(i.capitalize())  #this for loop is written to capitalize the columns in dataset

In [229]:
df.columns=n_columns

In [230]:
df

,Name,Online_order,Book_table,Rate,Dish_liked,Approx_cost(for two people),Listed_in(city)
0,Jalsa,Yes,Yes,4.1/5,"Pasta, Lunch Buffet, Masala Papad, Paneer Laja...",800,Banashankari
1,Spice Elephant,Yes,No,4.1/5,"Momos, Lunch Buffet, Chocolate Nirvana, Thai G...",800,Banashankari
2,San Churro Cafe,Yes,No,3.8/5,"Churros, Cannelloni, Minestrone Soup, Hot Choc...",800,Banashankari
3,Addhuri Udupi Bhojana,No,No,3.7/5,Masala Dosa,300,Banashankari
4,Grand Village,No,No,3.8/5,"Panipuri, Gol Gappe",600,Banashankari
...,...,...,...,...,...,...,...
51712,Best Brews - Four Points by Sheraton Bengaluru...,No,No,3.6 /5,NaN,"1,500",Whitefield
51713,Vinod Bar And Restaurant,No,No,NaN,NaN,600,Whitefield
51714,Plunge - Sheraton Grand Bengaluru Whitefield H...,No,No,NaN,NaN,"2,000",Whitefield
51715,Chime - Sheraton Grand Bengaluru Whitefield Ho...,No,Yes,4.3 /5,"Cocktails, Pizza, Buttermilk","2,500",Whitefield
51716,The Nest - The Den Bengaluru,No,No,3.4 /5,NaN,"1,500",Whitefield

In [231]:
df.rename(columns={"Approx_cost(for two people)":"Approx_cost(2 people)"},inplace=True)
df.rename(columns={"Listed_in(city)":"Banaglore(area)"},inplace=True)   #renaming the columns

In [232]:
df.head(1)

,Name,Online_order,Book_table,Rate,Dish_liked,Approx_cost(2 people),Banaglore(area)
0,Jalsa,Yes,Yes,4.1/5,"Pasta, Lunch Buffet, Masala Papad, Paneer Laja...",800,Banashankari

In [233]:
df.duplicated().sum()

16413

In [234]:
df.duplicated().value_counts()

False    35304
True     16413
Name: count, dtype: int64

In [235]:
df.drop_duplicates(inplace=True)  #droping the duplicates

In [236]:
df.duplicated().sum()

0

In [237]:
df.isna().sum() #checking the null values

Name                         0
Online_order                 0
Book_table                   0
Rate                      5715
Dish_liked               20390
Approx_cost(2 people)      240
Banaglore(area)              0
dtype: int64

In [238]:
df.drop(columns=["Dish_liked"],inplace=True)

In [239]:
df=df.fillna("") #filling the null  values

In [240]:
df.isna().sum()

Name                     0
Online_order             0
Book_table               0
Rate                     0
Approx_cost(2 people)    0
Banaglore(area)          0
dtype: int64

In [241]:
df.head(1)

    Name Online_order Book_table   Rate Approx_cost(2 people) Banaglore(area)
0  Jalsa          Yes        Yes  4.1/5                   800    Banashankari

In [242]:
df.columns

Index(['Name', 'Online_order', 'Book_table', 'Rate', 'Approx_cost(2 people)',
       'Banaglore(area)'],
      dtype='object')

In [243]:
df.reset_index(inplace=True) #reseting the index

In [244]:
df.shape

(35304, 7)

In [245]:
df.head()

,index,Name,Online_order,Book_table,Rate,Approx_cost(2 people),Banaglore(area)
0,0,Jalsa,Yes,Yes,4.1/5,800,Banashankari
1,1,Spice Elephant,Yes,No,4.1/5,800,Banashankari
2,2,San Churro Cafe,Yes,No,3.8/5,800,Banashankari
3,3,Addhuri Udupi Bhojana,No,No,3.7/5,300,Banashankari
4,4,Grand Village,No,No,3.8/5,600,Banashankari

In [246]:
df.drop(columns="index",inplace=True)

In [247]:
df

,Name,Online_order,Book_table,Rate,Approx_cost(2 people),Banaglore(area)
0,Jalsa,Yes,Yes,4.1/5,800,Banashankari
1,Spice Elephant,Yes,No,4.1/5,800,Banashankari
2,San Churro Cafe,Yes,No,3.8/5,800,Banashankari
3,Addhuri Udupi Bhojana,No,No,3.7/5,300,Banashankari
4,Grand Village,No,No,3.8/5,600,Banashankari
...,...,...,...,...,...,...
35299,The Crunch,No,No,3.3 /5,300,Whitefield
35300,Kale Cafe,No,No,,100,Whitefield
35301,Andhra Spices,No,No,3.2 /5,,Whitefield
35302,Bhagini,No,No,2.5 /5,800,Whitefield
35303,Plunge - Sheraton Grand Bengaluru Whitefield H...,No,No,,"2,000",Whitefield

In [248]:
df["Rate"][14]

'3.8/5'

In [249]:
df["Rate"]=df["Rate"].str.replace(" ","") #replacing space

In [250]:
df["Rate"]=df["Rate"].str.replace("/"," out of ") #replacing / to out of

In [251]:
df["Online_order"]=df["Online_order"].apply(lambda x: 1 if x== "Yes" else 0) #used to change yes no to 0 1

In [252]:
df["Book_table"]=df["Book_table"].apply (lambda x: 1 if x== "Yes" else 0)  #used to change yes no to 0 1

In [253]:
df.head(10)

,Name,Online_order,Book_table,Rate,Approx_cost(2 people),Banaglore(area)
0,Jalsa,1,1,4.1 out of 5,800,Banashankari
1,Spice Elephant,1,0,4.1 out of 5,800,Banashankari
2,San Churro Cafe,1,0,3.8 out of 5,800,Banashankari
3,Addhuri Udupi Bhojana,0,0,3.7 out of 5,300,Banashankari
4,Grand Village,0,0,3.8 out of 5,600,Banashankari
5,Timepass Dinner,1,0,3.8 out of 5,600,Banashankari
6,Rosewood International Hotel - Bar & Restaurant,0,0,3.6 out of 5,800,Banashankari
7,Onesta,1,1,4.6 out of 5,600,Banashankari
8,Penthouse Cafe,1,0,4.0 out of 5,700,Banashankari
9,Smacznego,1,0,4.2 out of 5,550,Banashankari

In [254]:
# if we want to export cleaned data file
#df.to_excel("Data_Cleaning_Zomato.xlsx")  || for xslx file
#df.to_csv("Data_Cleaning_Zomato.csv")    || for csv file